{\rtf1\ansi\ansicpg1252\cocoartf1561\cocoasubrtf600
{\fonttbl\f0\fswiss\fcharset0 Helvetica;}
{\colortbl;\red255\green255\blue255;}
{\*\expandedcolortbl;;}
\margl1440\margr1440\vieww10800\viewh8400\viewkind0
\pard\tx720\tx1440\tx2160\tx2880\tx3600\tx4320\tx5040\tx5760\tx6480\tx7200\tx7920\tx8640\pardirnatural\partightenfactor0

\f0\fs24 \cf0 [\{"Sentences":"By Angela Fritz , Deputy weather editor Greg Porter September 5, 2017 Hurricane Irma strengthened overnight to a dangerous Category 5 as it barrels toward the Greater Antilles and Southern Florida. Tuesday morning, NOAA Hurricane Hunters found the storm's maximum wind speeds are 175 mph. It now ranks among the strongest hurricanes ever recorded in the Atlantic Ocean. Forecasts suggest it will reach southern Florida and the Gulf of Mexico this weekend. Hurricane warnings have been issued for portions of the Leeward Islands and the Greater Antilles, including Puerto Rico. update. Over the weekend, the forecast track for this potentially devastating hurricane shifted south and west. It seems likely now that the storm will affect or strike the U.S. coast early next week, although meteorologists don't know exactly where. Florida and the Gulf Coast continue to be at risk. At 8 a.m. Irma will probably continue to be suppressed by the strong Atlantic high pressure beyond Wednesday, keeping the storm at major hurricane status and on a trajectory that places the storm in close proximity to Florida by next weekend. Potential U.S. impacts Forecasts from the European (top) and U.S. GFS (bottom) models Tuesday morning. It remains difficult to pinpoint if and where Irma will make landfall in the United States, but Florida is becoming the likely target. There is strong agreement in Irma's path through Friday, at which point Irma will probably be a major hurricane located just to the south of the Bahamas. The National Hurricane Center is forecasting tropical storm conditions to begin affecting Florida by Friday evening. All of the usual hazards are at play here; strong winds, heavy rain and dangerous storm surge. Storm surge may become the largest concern over the next few days, given the amount of time that Irma is spending over open water combined with the low-lying topography of southern Florida. Again, it should be noted that the forecast track for Irma will continue to change as we start to receive more aircraft data on the storm and as the large-scale environment features become more clear. At this point, residents from the gulf all the way to Maine should take special interest in forecast updates for Irma throughout the week. Brian Murphy contributed to this report. Angela Fritz Angela Fritz is an atmospheric scientist and The Washington Post's deputy weather editor. Before joining The Post, Fritz worked as a meteorologist at CNN in Atlanta and Weather Underground in San Francisco. She has a BS in meteorology and an MS in earth and atmospheric science. Follow Greg Porter Greg holds a B.S. in meteorology from the University of Massachusetts at Lowell and an M.S. in meteorology from the University of Maryland."\},\
\{"Sentences":"He warned that parts of Florida would be out of electricity for days if not longer and that more than 100,000 people may need shelter. Please read our Commenting Policy first. All rights reserved. result found. results found."\},\
\{"Sentences":"All rights reserved. All market data delayed 20 minutes. Irma remains a powerful Category 5 hurricane, the highest on the Saffir-Simspon Hurricane Wind Scale. Residents in Cuba and the Bahamas should be nearing completion on preparations for Irma. Hispaniola, Turks and Caicos Islands and southern Bahamas will face the brunt of Irma into Friday morning. The strongest winds are in the eye wall of the hurricane, which is expected to track near the Turks and Caicos and southern Bahamas through Friday night. As Irma continues to travel to the northwest through Saturday, northern Cuba and the central Bahamas will face the fury of powerful Irma. By Saturday night, Irma will turn to the north and will spread severe impacts into Florida and the central and northern Bahamas. Widespread power outages and significant damage to trees and structures are expected in these areas. The power may be out for weeks in some areas. Rough surf will spread outward from the storm and the strong winds from Irma will send a large and devastating storm surge across Turks and Caicos and Bahamas. In addition to damaging winds, Irma will also bring heavy rain over the next couple of days. In mountainous areas, especially Hispaniola and Cuba, flash flooding will be a much higher risk due to the water being funneled into valleys. There will also be a high risk for mudslides and road washouts. Weather conditions will improve on Friday for Hispaniola, and on Saturday for the Turks and Caicos and southern Bahamas as Irma pulls away. Dangerous weather conditions will begin to lessen on Sunday in Cuba, and on Monday for the northern and central Bahamas. Behind Irma, Hurricane Jose is churning about 800 miles east of the Lesser Antilles. Jose is expected to track to the west through the weekend and will eventually take a turn to the northwest. If Jose makes a close pass to the Leeward Islands, gusty winds and rain could impact islands that were battered by Irma. All rights reserved. All market data delayed 20 minutes."\},\
\{"Sentences":"After making landfall in Cuba late Friday night, the hurricane is expected to reach the Florida Keys between 5 a.m and 7 a.m. Sunday. It then struck the British Virgin Islands. On the morning of the 7th, the storm struck Puerto Rico before moving on to the Turks and Caicos Islands. The storm is expected to gain strength again as it crosses over the water between Cuba and Florida. WATCH: Hurricane Irma weakens slightly as it pounds Cuba, expected to strengthen again The hurricane is expected to pour somewhere between 10 to 20 inches of rain over the Florida Keys although some areas could see as much as 25 inches. Irma is expected to drop between 10 to 20 inches of rain over the Florida Keys, with isolated amounts of 25 inches, through Tuesday night. The dead included 11 on St. Martin and St. Barts, four in the U.S. Virgin Islands, four in the British Virgin Islands and one each on Anguilla and Barbuda. WATCH: Video shows extent of severe Irma damage suffered by St. Martin Evacuations: Around 6.3 million people asked to evacuate from their homes in Florida. A hurricane watch has also been established in neighbouring Georgia where another 640,000 people are expected to evacuate. READ MORE: Hurricane Irma batters Cuba as millions in Florida rush to evacuate More than 50,000 people in Florida are seeking shelter in schools, community centres and churches as Hurricane Irma nears the state. Please read our Commenting Policy first. All rights reserved. result found. results found.\'94\}]}